# brainfuck-py
这是一个用Python做的brainfuck<br>
参数:<br>
| 参数                   | 功能                                          | 示例         |
|:----------------------:|-----------------------------------------------|:---------------:|
| `--f <文件路径>`        | 指定 Brainfuck 代码文件                        | `--f hello.bf`  |
| `--speed <秒数>`        | 调整执行速度<br>(默认 0.1 秒)                   | `--speed 0.5`   |
| `--mem <行>x<列>`       | 自定义 2D 内存尺寸<br>(默认 10x12)              | `--mem 20x16`   |
| `--en`                 | 英文模式                                       | `--en`          |
